// composables/useGridItems.js
export function useGridItems() {
  return [
    {
      title: "ประสบการณ์ที่ยาวนาน",
      description: "เรามีประสบการณ์ในการให้บริการหลายปี ที่ช่วยให้เรารู้วิธีตอบสนองความต้องการของลูกค้าอย่างเต็มที่",
      icon: "la:business-time"
    },
    {
      title: "ทีมงานมืออาชีพ",
      description: "ทีมงานของเราประกอบด้วยผู้เชี่ยวชาญที่มีความสามารถและความชำนาญเฉพาะทางในแต่ละด้าน",
      icon: "fluent-mdl2:teamwork"
    },
    {
      title: "โซลูชันที่ปรับตามความต้องการ",
      description: "เราเข้าใจว่าธุรกิจแต่ละรายมีความต้องการที่แตกต่างกัน ดังนั้นเราจึงมุ่งเน้นการพัฒนาโซลูชันที่ตรงกับความต้องการของคุณ",
      icon: "teenyicons:adjust-vertical-alt-outline"
    },
    {
      title: "บริการครบวงจร",
      description: "เรามีบริการครบวงจรที่ครอบคลุมตั้งแต่การออกแบบเว็บไซต์ กราฟิกดีไซน์ ระบบเน็ตเวิร์ค และการตลาดออนไลน์",
      icon: "streamline:ai-technology-spark"
    }
  ];
}
